"Scan for Large and Old Files" = "Buscar archivos grandes y antiguos";
"Erase with CleanMyMac" = "Borrar con CleanMyMac";
"Securely Erase with CleanMyMac" = "Borrar de forma segura con CleanMyMac";
"Clean with CleanMyMac" = "Limpiar con CleanMyMac";
"Uninstall with CleanMyMac" = "Desinstalar con CleanMyMac";
"Clean iPhoto Library with CleanMyMac" = "Limpiar Fototeca con CleanMyMac";
